      *---------------------------------------------------------------*
      *  FILE-STATUS DEL FICHERO                                      *
      *---------------------------------------------------------------*
       01  CONSTANTES-WORKING.
      *
           05  FS-FILE-DATA             PIC XX      VALUE '00'.
      *
  
