       *
           SELECT FILE-DATA    ASSIGN TO EXTERNAL  FILEDAT
                  ORGANIZATION  IS LINE SEQUENTIAL  
                  FILE STATUS   IS FS-FILE-DATA.
       * 

